jason3w/pyflash-web/Puya.PY32F0xx_DFP.1.2.8/Drivers/CMSIS/Device/PY32F0xx/Include/py32f021x8.h
/********************  Bits definition for ADC_CR register  *******************/
#define ADC_CR_ADEN_Pos           (0U)
#define ADC_CR_ADEN_Msk           (0x1UL << ADC_CR_ADEN_Pos)                    /*!< 0x00000001 */
#define ADC_CR_ADEN                ADC_CR_ADEN_Msk                              /*!< ADC enable */
#define ADC_CR_ADDIS_Pos          (1U)
#define ADC_CR_ADDIS_Msk          (0x1UL << ADC_CR_ADDIS_Pos)                   /*!< 0x00000002 */
#define ADC_CR_ADDIS               ADC_CR_ADDIS_Msk                             /*!< ADC disable */
#define ADC_CR_ADSTART_Pos        (2U)
#define ADC_CR_ADSTART_Msk        (0x1UL << ADC_CR_ADSTART_Pos)                 /*!< 0x00000004 */
#define ADC_CR_ADSTART             ADC_CR_ADSTART_Msk                           /*!< ADC group regular conversion start */
#define ADC_CR_MSBSEL_Pos         (3U)
#define ADC_CR_MSBSEL_Msk         (0x1UL << ADC_CR_MSBSEL_Pos)                  /*!< 0x00000008 */
#define ADC_CR_MSBSEL              ADC_CR_MSBSEL_Msk                            /*!< ADC resolution highest bit conversion time control */
#define ADC_CR_ADSTP_Pos          (4U)
#define ADC_CR_ADSTP_Msk          (0x1UL << ADC_CR_ADSTP_Pos)                   /*!< 0x00000010 */
#define ADC_CR_ADSTP               ADC_CR_ADSTP_Msk                             /*!< ADC group regular conversion stop */
#define ADC_CR_VREFBUF_EN_Pos     (5U)
#define ADC_CR_VREFBUF_EN_Msk     (0x1UL << ADC_CR_VREFBUF_EN_Pos)              /*!< 0x00000020 */
#define ADC_CR_VREFBUF_EN          ADC_CR_VREFBUF_EN_Msk                        /*!< ADC VrefBuffer enable */
#define ADC_CR_VREFBUF_SEL_Pos    (6U)
#define ADC_CR_VREFBUF_SEL_Msk    (0x3UL << ADC_CR_VREFBUF_SEL_Pos)             /*!< 0x000000C0 */
#define ADC_CR_VREFBUF_SEL         ADC_CR_VREFBUF_SEL_Msk                       /*!< ADC VrefBuffer output voltage select */
#define ADC_CR_VREFBUF_SEL_0      (0x1UL << ADC_CR_VREFBUF_SEL_Pos)             /*!< 0x00000040 */
#define ADC_CR_VREFBUF_SEL_1      (0x2UL << ADC_CR_VREFBUF_SEL_Pos)             /*!< 0x00000080 */

#define ADC_CR_ADCAL_Pos          (31U)
#define ADC_CR_ADCAL_Msk          (0x1UL << ADC_CR_ADCAL_Pos)                   /*!< 0x80000000 */
#define ADC_CR_ADCAL               ADC_CR_ADCAL_Msk                             /*!< ADC calibration */

/*******************  Bits definition for ADC_CFGR1 register  *****************/
#define ADC_CFGR1_DMAEN_Pos       (0U)
#define ADC_CFGR1_DMAEN_Msk       (0x1UL << ADC_CFGR1_DMAEN_Pos)                /*!< 0x00000001 */
#define ADC_CFGR1_DMAEN            ADC_CFGR1_DMAEN_Msk                          /*!< ADC DMA transfer enable */
#define ADC_CFGR1_DMACFG_Pos      (1U)
#define ADC_CFGR1_DMACFG_Msk      (0x1UL << ADC_CFGR1_DMACFG_Pos)               /*!< 0x00000002 */
#define ADC_CFGR1_DMACFG           ADC_CFGR1_DMACFG_Msk                         /*!< ADC DMA transfer configuration */
#define ADC_CFGR1_SCANDIR_Pos     (2U)
#define ADC_CFGR1_SCANDIR_Msk     (0x1UL << ADC_CFGR1_SCANDIR_Pos)              /*!< 0x00000004 */
#define ADC_CFGR1_SCANDIR          ADC_CFGR1_SCANDIR_Msk                        /*!< ADC group regular sequencer scan direction */
#define ADC_CFGR1_RESSEL_Pos      (3U)
#define ADC_CFGR1_RESSEL_Msk      (0x3UL << ADC_CFGR1_RESSEL_Pos)               /*!< 0x00000018 */
#define ADC_CFGR1_RESSEL           ADC_CFGR1_RESSEL_Msk                         /*!< ADC data resolution */
#define ADC_CFGR1_RESSEL_0        (0x1UL << ADC_CFGR1_RESSEL_Pos)               /*!< 0x00000008 */
#define ADC_CFGR1_RESSEL_1        (0x2UL << ADC_CFGR1_RESSEL_Pos)               /*!< 0x00000010 */
#define ADC_CFGR1_ALIGN_Pos       (5U)
#define ADC_CFGR1_ALIGN_Msk       (0x1UL << ADC_CFGR1_ALIGN_Pos)                /*!< 0x00000020 */
#define ADC_CFGR1_ALIGN            ADC_CFGR1_ALIGN_Msk                          /*!< ADC data alignement */
#define ADC_CFGR1_EXTSEL_Pos      (6U)
#define ADC_CFGR1_EXTSEL_Msk      (0x7UL << ADC_CFGR1_EXTSEL_Pos)               /*!< 0x000001C0 */
#define ADC_CFGR1_EXTSEL           ADC_CFGR1_EXTSEL_Msk                         /*!< ADC group regular external trigger source */
#define ADC_CFGR1_EXTSEL_0        (0x1UL << ADC_CFGR1_EXTSEL_Pos)               /*!< 0x00000040 */
#define ADC_CFGR1_EXTSEL_1        (0x2UL << ADC_CFGR1_EXTSEL_Pos)               /*!< 0x00000080 */
#define ADC_CFGR1_EXTSEL_2        (0x4UL << ADC_CFGR1_EXTSEL_Pos)               /*!< 0x00000100 */
#define ADC_CFGR1_EXTEN_Pos       (10U)
#define ADC_CFGR1_EXTEN_Msk       (0x3UL << ADC_CFGR1_EXTEN_Pos)                /*!< 0x00000C00 */
#define ADC_CFGR1_EXTEN            ADC_CFGR1_EXTEN_Msk                          /*!< ADC group regular external trigger polarity */
#define ADC_CFGR1_EXTEN_0         (0x1UL << ADC_CFGR1_EXTEN_Pos)                /*!< 0x00000400 */
#define ADC_CFGR1_EXTEN_1         (0x2UL << ADC_CFGR1_EXTEN_Pos)                /*!< 0x00000800 */
#define ADC_CFGR1_OVRMOD_Pos      (12U)
#define ADC_CFGR1_OVRMOD_Msk      (0x1UL << ADC_CFGR1_OVRMOD_Pos)               /*!< 0x00001000 */
#define ADC_CFGR1_OVRMOD           ADC_CFGR1_OVRMOD_Msk                         /*!< ADC group regular overrun configuration */
#define ADC_CFGR1_CONT_Pos        (13U)
#define ADC_CFGR1_CONT_Msk        (0x1UL << ADC_CFGR1_CONT_Pos)                 /*!< 0x00002000 */
#define ADC_CFGR1_CONT             ADC_CFGR1_CONT_Msk                           /*!< ADC group regular continuous conversion mode */
#define ADC_CFGR1_WAIT_Pos        (14U)
#define ADC_CFGR1_WAIT_Msk        (0x1UL << ADC_CFGR1_WAIT_Pos)                 /*!< 0x00004000 */
#define ADC_CFGR1_WAIT             ADC_CFGR1_WAIT_Msk                           /*!< ADC low power auto wait */
#define ADC_CFGR1_DISCEN_Pos      (16U)
#define ADC_CFGR1_DISCEN_Msk      (0x1UL << ADC_CFGR1_DISCEN_Pos)               /*!< 0x00010000 */
#define ADC_CFGR1_DISCEN           ADC_CFGR1_DISCEN_Msk                         /*!< ADC group regular sequencer discontinuous mode */
#define ADC_CFGR1_AWDSGL_Pos      (22U)
#define ADC_CFGR1_AWDSGL_Msk      (0x1UL << ADC_CFGR1_AWDSGL_Pos)               /*!< 0x00400000 */
#define ADC_CFGR1_AWDSGL           ADC_CFGR1_AWDSGL_Msk                         /*!< ADC analog watchdog 1 monitoring a single channel or all channels */
#define ADC_CFGR1_AWDEN_Pos       (23U)
#define ADC_CFGR1_AWDEN_Msk       (0x1UL << ADC_CFGR1_AWDEN_Pos)                /*!< 0x00800000 */
#define ADC_CFGR1_AWDEN            ADC_CFGR1_AWDEN_Msk                          /*!< ADC analog watchdog 1 enable on scope ADC group regular */
#define ADC_CFGR1_AWDCH_Pos       (26U)
#define ADC_CFGR1_AWDCH_Msk       (0xFUL << ADC_CFGR1_AWDCH_Pos)                /*!< 0x3C000000 */
#define ADC_CFGR1_AWDCH            ADC_CFGR1_AWDCH_Msk                          /*!< ADC analog watchdog 1 monitored channel selection */
#define ADC_CFGR1_AWDCH_0         (0x01UL << ADC_CFGR1_AWDCH_Pos)               /*!< 0x04000000 */
#define ADC_CFGR1_AWDCH_1         (0x02UL << ADC_CFGR1_AWDCH_Pos)               /*!< 0x08000000 */
#define ADC_CFGR1_AWDCH_2         (0x04UL << ADC_CFGR1_AWDCH_Pos)               /*!< 0x10000000 */
#define ADC_CFGR1_AWDCH_3         (0x08UL << ADC_CFGR1_AWDCH_Pos)               /*!< 0x20000000 */

/*******************  Bits definition for ADC_CFGR2 register  *****************/
#define ADC_CFGR2_CKMODE_Pos      (28U)
#define ADC_CFGR2_CKMODE_Msk      (0xFUL << ADC_CFGR2_CKMODE_Pos)               /*!< 0xF0000000 */
#define ADC_CFGR2_CKMODE           ADC_CFGR2_CKMODE_Msk                         /*!< ADC clock source and prescaler (prescaler only for clock source synchronous) */
#define ADC_CFGR2_CKMODE_0        (0x1UL << ADC_CFGR2_CKMODE_Pos)               /*!< 0x10000000 */
#define ADC_CFGR2_CKMODE_1        (0x2UL << ADC_CFGR2_CKMODE_Pos)               /*!< 0x20000000 */
#define ADC_CFGR2_CKMODE_2        (0x4UL << ADC_CFGR2_CKMODE_Pos)               /*!< 0x40000000 */
#define ADC_CFGR2_CKMODE_3        (0x8UL << ADC_CFGR2_CKMODE_Pos)               /*!< 0x80000000 */

/******************  Bit definition for ADC_SMPR0 register  ********************/
#define ADC_SMPR0_SMP0_Pos        (0U)
#define ADC_SMPR0_SMP0_Msk        (0x7UL << ADC_SMPR0_SMP0_Pos)                   /*!< 0x00000007 */
#define ADC_SMPR0_SMP0             ADC_SMPR0_SMP0_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP0_0          (0x1UL << ADC_SMPR0_SMP0_Pos)                   /*!< 0x00000001 */
#define ADC_SMPR0_SMP0_1          (0x2UL << ADC_SMPR0_SMP0_Pos)                   /*!< 0x00000002 */
#define ADC_SMPR0_SMP0_2          (0x4UL << ADC_SMPR0_SMP0_Pos)                   /*!< 0x00000004 */
#define ADC_SMPR0_SMP1_Pos        (3U)
#define ADC_SMPR0_SMP1_Msk        (0x7UL << ADC_SMPR0_SMP1_Pos)                   /*!< 0x00000038 */
#define ADC_SMPR0_SMP1             ADC_SMPR0_SMP1_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP1_0          (0x1UL << ADC_SMPR0_SMP1_Pos)                   /*!< 0x00000008 */
#define ADC_SMPR0_SMP1_1          (0x2UL << ADC_SMPR0_SMP1_Pos)                   /*!< 0x00000010 */
#define ADC_SMPR0_SMP1_2          (0x4UL << ADC_SMPR0_SMP1_Pos)                   /*!< 0x00000020 */
#define ADC_SMPR0_SMP2_Pos        (6U)
#define ADC_SMPR0_SMP2_Msk        (0x7UL << ADC_SMPR0_SMP2_Pos)                   /*!< 0x000001C0 */
#define ADC_SMPR0_SMP2             ADC_SMPR0_SMP2_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP2_0          (0x1UL << ADC_SMPR0_SMP2_Pos)                   /*!< 0x00000040 */
#define ADC_SMPR0_SMP2_1          (0x2UL << ADC_SMPR0_SMP2_Pos)                   /*!< 0x00000080 */
#define ADC_SMPR0_SMP2_2          (0x4UL << ADC_SMPR0_SMP2_Pos)                   /*!< 0x00000100 */
#define ADC_SMPR0_SMP3_Pos        (9U)
#define ADC_SMPR0_SMP3_Msk        (0x7UL << ADC_SMPR0_SMP3_Pos)                   /*!< 0x00000E00 */
#define ADC_SMPR0_SMP3             ADC_SMPR0_SMP3_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP3_0          (0x1UL << ADC_SMPR0_SMP3_Pos)                   /*!< 0x00000200 */
#define ADC_SMPR0_SMP3_1          (0x2UL << ADC_SMPR0_SMP3_Pos)                   /*!< 0x00000400 */
#define ADC_SMPR0_SMP3_2          (0x4UL << ADC_SMPR0_SMP3_Pos)                   /*!< 0x00000800 */
#define ADC_SMPR0_SMP4_Pos        (12U)
#define ADC_SMPR0_SMP4_Msk        (0x7UL << ADC_SMPR0_SMP4_Pos)                   /*!< 0x00007000 */
#define ADC_SMPR0_SMP4             ADC_SMPR0_SMP4_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP4_0          (0x1UL << ADC_SMPR0_SMP4_Pos)                   /*!< 0x00001000 */
#define ADC_SMPR0_SMP4_1          (0x2UL << ADC_SMPR0_SMP4_Pos)                   /*!< 0x00002000 */
#define ADC_SMPR0_SMP4_2          (0x4UL << ADC_SMPR0_SMP4_Pos)                   /*!< 0x00004000 */
#define ADC_SMPR0_SMP5_Pos        (15U)
#define ADC_SMPR0_SMP5_Msk        (0x7UL << ADC_SMPR0_SMP5_Pos)                   /*!< 0x00038000 */
#define ADC_SMPR0_SMP5             ADC_SMPR0_SMP5_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP5_0          (0x1UL << ADC_SMPR0_SMP5_Pos)                   /*!< 0x00008000 */
#define ADC_SMPR0_SMP5_1          (0x2UL << ADC_SMPR0_SMP5_Pos)                   /*!< 0x00010000 */
#define ADC_SMPR0_SMP5_2          (0x4UL << ADC_SMPR0_SMP5_Pos)                   /*!< 0x00020000 */
#define ADC_SMPR0_SMP6_Pos        (18U)
#define ADC_SMPR0_SMP6_Msk        (0x7UL << ADC_SMPR0_SMP6_Pos)                   /*!< 0x001C0000 */
#define ADC_SMPR0_SMP6             ADC_SMPR0_SMP6_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP6_0          (0x1UL << ADC_SMPR0_SMP6_Pos)                   /*!< 0x00040000 */
#define ADC_SMPR0_SMP6_1          (0x2UL << ADC_SMPR0_SMP6_Pos)                   /*!< 0x00080000 */
#define ADC_SMPR0_SMP6_2          (0x4UL << ADC_SMPR0_SMP6_Pos)                   /*!< 0x00100000 */
#define ADC_SMPR0_SMP7_Pos        (21U)
#define ADC_SMPR0_SMP7_Msk        (0x7UL << ADC_SMPR0_SMP7_Pos)                   /*!< 0x00E00000 */
#define ADC_SMPR0_SMP7             ADC_SMPR0_SMP7_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP7_0          (0x1UL << ADC_SMPR0_SMP7_Pos)                   /*!< 0x00200000 */
#define ADC_SMPR0_SMP7_1          (0x2UL << ADC_SMPR0_SMP7_Pos)                   /*!< 0x00400000 */
#define ADC_SMPR0_SMP7_2          (0x4UL << ADC_SMPR0_SMP7_Pos)                   /*!< 0x00800000 */
#define ADC_SMPR0_SMP8_Pos        (24U)
#define ADC_SMPR0_SMP8_Msk        (0x7UL << ADC_SMPR0_SMP8_Pos)                   /*!< 0x07000000 */
#define ADC_SMPR0_SMP8             ADC_SMPR0_SMP8_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP8_0          (0x1UL << ADC_SMPR0_SMP8_Pos)                   /*!< 0x01000000 */
#define ADC_SMPR0_SMP8_1          (0x2UL << ADC_SMPR0_SMP8_Pos)                   /*!< 0x02000000 */
#define ADC_SMPR0_SMP8_2          (0x4UL << ADC_SMPR0_SMP8_Pos)                   /*!< 0x04000000 */
#define ADC_SMPR0_SMP9_Pos        (27U)
#define ADC_SMPR0_SMP9_Msk        (0x7UL << ADC_SMPR0_SMP9_Pos)                   /*!< 0x38000000 */
#define ADC_SMPR0_SMP9             ADC_SMPR0_SMP9_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR0_SMP9_0          (0x1UL << ADC_SMPR0_SMP9_Pos)                   /*!< 0x08000000 */
#define ADC_SMPR0_SMP9_1          (0x2UL << ADC_SMPR0_SMP9_Pos)                   /*!< 0x10000000 */
#define ADC_SMPR0_SMP9_2          (0x4UL << ADC_SMPR0_SMP9_Pos)                   /*!< 0x20000000 */

/******************  Bit definition for ADC_SMPR1 register  ********************/
#define ADC_SMPR1_SMP10_Pos        (0U)
#define ADC_SMPR1_SMP10_Msk        (0x7UL << ADC_SMPR1_SMP10_Pos)                   /*!< 0x00000007 */
#define ADC_SMPR1_SMP10             ADC_SMPR1_SMP10_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR1_SMP10_0          (0x1UL << ADC_SMPR1_SMP10_Pos)                   /*!< 0x00000001 */
#define ADC_SMPR1_SMP10_1          (0x2UL << ADC_SMPR1_SMP10_Pos)                   /*!< 0x00000002 */
#define ADC_SMPR1_SMP10_2          (0x4UL << ADC_SMPR1_SMP10_Pos)                   /*!< 0x00000004 */
#define ADC_SMPR1_SMP11_Pos        (3U)
#define ADC_SMPR1_SMP11_Msk        (0x7UL << ADC_SMPR1_SMP11_Pos)                   /*!< 0x00000038 */
#define ADC_SMPR1_SMP11             ADC_SMPR1_SMP11_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR1_SMP11_0          (0x1UL << ADC_SMPR1_SMP11_Pos)                   /*!< 0x00000008 */
#define ADC_SMPR1_SMP11_1          (0x2UL << ADC_SMPR1_SMP11_Pos)                   /*!< 0x00000010 */
#define ADC_SMPR1_SMP11_2          (0x4UL << ADC_SMPR1_SMP11_Pos)                   /*!< 0x00000020 */
#define ADC_SMPR1_SMP12_Pos        (6U)
#define ADC_SMPR1_SMP12_Msk        (0x7UL << ADC_SMPR1_SMP12_Pos)                   /*!< 0x000001C0 */
#define ADC_SMPR1_SMP12             ADC_SMPR1_SMP12_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR1_SMP12_0          (0x1UL << ADC_SMPR1_SMP12_Pos)                   /*!< 0x00000040 */
#define ADC_SMPR1_SMP12_1          (0x2UL << ADC_SMPR1_SMP12_Pos)                   /*!< 0x00000080 */
#define ADC_SMPR1_SMP12_2          (0x4UL << ADC_SMPR1_SMP12_Pos)                   /*!< 0x00000100 */
#define ADC_SMPR1_SMP13_Pos        (9U)
#define ADC_SMPR1_SMP13_Msk        (0x7UL << ADC_SMPR1_SMP13_Pos)                   /*!< 0x00000E00 */
#define ADC_SMPR1_SMP13             ADC_SMPR1_SMP13_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR1_SMP13_0          (0x1UL << ADC_SMPR1_SMP13_Pos)                   /*!< 0x00000200 */
#define ADC_SMPR1_SMP13_1          (0x2UL << ADC_SMPR1_SMP13_Pos)                   /*!< 0x00000400 */
#define ADC_SMPR1_SMP13_2          (0x4UL << ADC_SMPR1_SMP13_Pos)                   /*!< 0x00000800 */
#define ADC_SMPR1_SMP14_Pos        (12U)
#define ADC_SMPR1_SMP14_Msk        (0x7UL << ADC_SMPR1_SMP14_Pos)                   /*!< 0x00007000 */
#define ADC_SMPR1_SMP14             ADC_SMPR1_SMP14_Msk                             /*!< ADC group of channels sampling time */
#define ADC_SMPR1_SMP14_0          (0x1UL << ADC_SMPR1_SMP14_Pos)                   /*!< 0x00001000 */
#define ADC_SMPR1_SMP14_1          (0x2UL << ADC_SMPR1_SMP14_Pos)                   /*!< 0x00002000 */
#define ADC_SMPR1_SMP14_2          (0x4UL << ADC_SMPR1_SMP14_Pos)                   /*!< 0x00004000 */

/*******************  Bit definition for ADC_TR register  ********************/
#define ADC_TR_LT_Pos           (0U)
#define ADC_TR_LT_Msk           (0xFFFUL << ADC_TR_LT_Pos)                  /*!< 0x00000FFF */
#define ADC_TR_LT                ADC_TR_LT_Msk                              /*!< ADC analog watchdog 1 threshold low */
#define ADC_TR_LT_0             (0x001UL << ADC_TR_LT_Pos)                  /*!< 0x00000001 */
#define ADC_TR_LT_1             (0x002UL << ADC_TR_LT_Pos)                  /*!< 0x00000002 */
#define ADC_TR_LT_2             (0x004UL << ADC_TR_LT_Pos)                  /*!< 0x00000004 */
#define ADC_TR_LT_3             (0x008UL << ADC_TR_LT_Pos)                  /*!< 0x00000008 */
#define ADC_TR_LT_4             (0x010UL << ADC_TR_LT_Pos)                  /*!< 0x00000010 */
#define ADC_TR_LT_5             (0x020UL << ADC_TR_LT_Pos)                  /*!< 0x00000020 */
#define ADC_TR_LT_6             (0x040UL << ADC_TR_LT_Pos)                  /*!< 0x00000040 */
#define ADC_TR_LT_7             (0x080UL << ADC_TR_LT_Pos)                  /*!< 0x00000080 */
#define ADC_TR_LT_8             (0x100UL << ADC_TR_LT_Pos)                  /*!< 0x00000100 */
#define ADC_TR_LT_9             (0x200UL << ADC_TR_LT_Pos)                  /*!< 0x00000200 */
#define ADC_TR_LT_10            (0x400UL << ADC_TR_LT_Pos)                  /*!< 0x00000400 */
#define ADC_TR_LT_11            (0x800UL << ADC_TR_LT_Pos)                  /*!< 0x00000800 */
#define ADC_TR_HT_Pos           (16U)
#define ADC_TR_HT_Msk           (0xFFFUL << ADC_TR_HT_Pos)                  /*!< 0x0FFF0000 */
#define ADC_TR_HT                ADC_TR_HT_Msk                              /*!< ADC Analog watchdog 1 threshold high */
#define ADC_TR_HT_0             (0x001UL << ADC_TR_HT_Pos)                  /*!< 0x00010000 */
#define ADC_TR_HT_1             (0x002UL << ADC_TR_HT_Pos)                  /*!< 0x00020000 */
#define ADC_TR_HT_2             (0x004UL << ADC_TR_HT_Pos)                  /*!< 0x00040000 */
#define ADC_TR_HT_3             (0x008UL << ADC_TR_HT_Pos)                  /*!< 0x00080000 */
#define ADC_TR_HT_4             (0x010UL << ADC_TR_HT_Pos)                  /*!< 0x00100000 */
#define ADC_TR_HT_5             (0x020UL << ADC_TR_HT_Pos)                  /*!< 0x00200000 */
#define ADC_TR_HT_6             (0x040UL << ADC_TR_HT_Pos)                  /*!< 0x00400000 */
#define ADC_TR_HT_7             (0x080UL << ADC_TR_HT_Pos)                  /*!< 0x00800000 */
#define ADC_TR_HT_8             (0x100UL << ADC_TR_HT_Pos)                  /*!< 0x01000000 */
#define ADC_TR_HT_9             (0x200UL << ADC_TR_HT_Pos)                  /*!< 0x02000000 */
#define ADC_TR_HT_10            (0x400UL << ADC_TR_HT_Pos)                  /*!< 0x04000000 */
#define ADC_TR_HT_11            (0x800UL << ADC_TR_HT_Pos)                  /*!< 0x08000000 */

